app/controllers/houses_controller.rb

  def index
    @user= User.find_by(id: params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]

  def create

    @house = House.new(house_params)
    @house.user_id = params[:user_id]


    if @house.save
---
INSERT INTO "houses" ("state", "city", "address", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["state", "asdfads"], ["city", "asdf"], ["address", "asdf"], ["created_at", "2020-11-01 19:58:40.270425"], ["updated_at", "2020-11-01 19:58:40.270425"], ["user_id", 21]]

  def update
    if @house.update(house_params)
---
UPDATE "houses" SET "state" = ?, "city" = ?, "address" = ?, "updated_at" = ? WHERE "houses"."id" = ?  [["state", "Florida"], ["city", "Miami"], ["address", "234 Beach st"], ["updated_at", "2020-11-03 19:14:26.748618"], ["id", 3]]

  def destroy
    @house.destroy
---
DELETE FROM "houses" WHERE "houses"."id" = ?  [["id", 3]]